//This detection monitors who is accessing external repositories to fetch or push code within the last 7days

DeviceProcessEvents
| where TimeGenerated >= ago(7d) //Change timeframe to liking
| where InitiatingProcessVersionInfoProductName in (@"Git") // Add tools that can be used to Fetch/Pull/Push Code
| where InitiatingProcessCommandLine contains @"fetch" 
  or InitiatingProcessCommandLine contains @"push"
  or InitiatingProcessCommandLine contains @"pull"
| where ProcessCommandLine contains @"https" or ProcessCommandLine contains @"http" 
| where AccountUpn != "" //Throwing False positives and/or showing processes on a host. I excldued so I can just see specific users fetching or pushing code.
| where ProcessCommandLine !contains @"ENTER COMPANY REPO" //Excluds Compnay Repos
    and ProcessCommandLine !contains "pwsh.exe" //Throwing False Positives
    and ProcessCommandLine !contains "powershell.exe" //Throwing False Positives
| summarize by AccountUPN=AccountUpn, Source=DeviceName, RemoteRepository=ProcessCommandLine
| join (IdentityInfo) on AccountUPN //Joined Identity Table to get the users job title
| summarize by AccountUPN, JobTitle, Source, RemoteRepository
