//This query detects rogue devices on a network. It utilizes Defender for Endpoint device discovery.

let ipRanges = dynamic(["Enter Subnet", "Enter Subnet", "Enter Subnet"]);
DeviceInfo
| where Timestamp >= ago(60d)
| where OnboardingStatus != "Onboarded"
| where DeviceType == "NetworkDevice"
| where Vendor !in ("Enter Known Vendor", "Enter Known Vendor", "Enter Known Vendor") 
| summarize arg_max(Timestamp, *) by DeviceId
| where isempty(MergedToDeviceId) 
| invoke SeenBy()
| project Timestamp, DeviceId, DeviceName, DeviceType, Vendor//, SeenBy, PublicIP
| join DeviceNetworkInfo on DeviceId
| extend IPAddresses_0_IPAddress = parse_json(IPAddresses)[0].IPAddress
| where ipv4_is_in_any_range(tostring(IPAddresses_0_IPAddress).ipRanges)
| project Timestamp, DeviceId, DeviceName, DeviceType, Vendor, tostring(IPAddresses_0_IPAddress), MacAddress, SeenBy

